app/controllers/bodytemperatures_controller.rb

SELECT "bodytemperatures".* FROM "bodytemperatures" WHERE "bodytemperatures"."day" = ? ORDER BY "bodytemperatures"."reason" DESC  [["day", "2021-05-22"]]
SELECT "bodytemperatures".* FROM "bodytemperatures"
---
   def index
    @bodytemperatures = Bodytemperature.where(day:Date.today).order(reason: "DESC").order(temper: "DESC")
    # @emeployees = Employee.all.bodytemperatures
    @unsubmitters = Bodytemperature.where.not(day:Date.today)

SELECT  "bodytemperatures".* FROM "bodytemperatures" WHERE "bodytemperatures"."number" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT  "employees".* FROM "employees" WHERE "employees"."number" = ? LIMIT ?  [["number", 12241], ["LIMIT", 1]]
INSERT INTO "bodytemperatures" ("temper", "created_at", "updated_at", "human_id", "reason", "item", "day") VALUES (?, ?, ?, ?, ?, ?, ?)  [["temper", 36.0], ["created_at", "2021-05-22 07:31:42.166563"], ["updated_at", "2021-05-22 07:31:42.166563"], ["human_id", 17], ["reason", ""], ["item", "体調に問題はない"], ["day", "2021-05-22"]]
---
   def create
     require"date"

     @employee =  Employee.find_by(number: params[:bodytemperature][:number])
     @bodytemperature = @employee.bodytemperatures.new(bodytemperatures_params)
     @bodytemperature.day = Date.today
     if (@bodytemperature.save && @bodytemperature.temper <= 36.9 && @bodytemperature.condition == "体調に問題はない" )

SELECT  "bodytemperatures".* FROM "bodytemperatures" WHERE "bodytemperatures"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
DELETE FROM "bodytemperatures" WHERE "bodytemperatures"."id" = ?  [["id", 24]]
---
   def destroy
     @bodytemperature = Bodytemperature.find(params[:id])
     @bodytemperature.destroy

SELECT  "bodytemperatures".* FROM "bodytemperatures" WHERE "bodytemperatures"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def edit
     @bodytemperature = Bodytemperature.find(params[:id])

SELECT  "bodytemperatures".* FROM "bodytemperatures" WHERE "bodytemperatures"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]
UPDATE "bodytemperatures" SET "temper" = ?, "item" = ?, "reason" = ?, "updated_at" = ? WHERE "bodytemperatures"."id" = ?  [["temper", 36.0], ["item", "気分がすぐれない"], ["reason", "頭が痛い"], ["updated_at", "2021-05-25 09:59:29.778327"], ["id", 26]]
---
    def update
     @bodytemperature = Bodytemperature.find(params[:id])
     @bodytemperature.temper = params[:bodytemperature][:temper]
     @bodytemperature.condition = params[:bodytemperature][:condition]
     @bodytemperature.reason = params[:bodytemperature][:reason]
     # @bodytemperature.save

     if (@bodytemperature.save && @bodytemperature.temper <= 36.9 && @bodytemperature.condition == "体調に問題はない" )