app/controllers/bodytemperatures_controller.rb

 def index
    @bodytemperatures = Bodytemperature.where(day:Date.today).order(temper: :"DESC")
    # @emeployees = Employee.all.bodytemperatures

    # @unsubmitters = Bodytemperature.where(day:Date.today) && Employee.where(day:Date.today)





    @employees_id = Employee.all.map(&:id)
    # binding.pry
    @bodytemperatures.each do |bt|
     @employees_id.delete(bt.employee_id)
    # binding.pry
     end
    #  binding.pry
    @unsubmitters = Employee.where(id:@employees_id)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]