app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "中阿賀"], ["number", 262552], ["created_at", "2021-05-23 07:29:29.102246"], ["updated_at", "2021-05-23 07:29:29.102246"]]
---
    def create
        @employee = Employee.create(employees_params)

SELECT "employees".* FROM "employees"
SELECT "employees".* FROM "employees" ORDER BY "employees"."number" ASC
---
    def index
        @employee = Employee.all
        @employee = Employee.order(number: "ASC")

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "employees" SET "number" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["number", 1220], ["updated_at", "2021-05-26 13:12:38.484978"], ["id", 22]]
---
    def update
        @employee = Employee.find(params[:id])
        @employee.name = params[:employee][:name]
        @employee.number = params[:employee][:number]
        @employee.save