app/controllers/humen_controller.rb

INSERT INTO "humen" ("name", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "佐藤太郎"], ["number", 4827], ["created_at", "2021-04-14 15:52:14.516261"], ["updated_at", "2021-04-14 15:52:14.516261"]]
INSERT INTO "humen" ("name", "number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "佐藤かあさ"], ["number", 9188], ["created_at", "2021-04-29 12:54:01.235616"], ["updated_at", "2021-04-29 12:54:01.235616"]]
---
    def create
        @human = Human.create(humen_params)
        @human.save